In [1]:
import pandas as pd
import numpy as np

In [9]:
data={
    'A':[1,2,np.nan,4,5],  #np.nan used to enter null value
    'B':[np.nan,2,3,4,5],
    'C':[np.nan,np.nan,3,4,5]
}
df=pd.DataFrame(data)
df

     A    B    C
0  1.0  NaN  NaN
1  2.0  2.0  NaN
2  NaN  3.0  3.0
3  4.0  4.0  4.0
4  5.0  5.0  5.0

In [10]:
df.isna().sum()#Counts how many null values a column have

A    1
B    1
C    2
dtype: int64

In [11]:
df.isna().any() #Checks how many columns have null values

A    True
B    True
C    True
dtype: bool

In [12]:
df.dropna()

     A    B    C
3  4.0  4.0  4.0
4  5.0  5.0  5.0

In [15]:
df.dropna(thresh=2)

     A    B    C
1  2.0  2.0  NaN
2  NaN  3.0  3.0
3  4.0  4.0  4.0
4  5.0  5.0  5.0

In [20]:
values={'A':3,'B':1,'C':1}
df.fillna(values)

     A    B    C
0  1.0  1.0  1.0
1  2.0  2.0  1.0
2  3.0  3.0  3.0
3  4.0  4.0  4.0
4  5.0  5.0  5.0

In [21]:
df.fillna(df.mean())

     A    B    C
0  1.0  3.5  4.0
1  2.0  2.0  4.0
2  3.0  3.0  3.0
3  4.0  4.0  4.0
4  5.0  5.0  5.0